RAE2822_Airfoil_HISA/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    symmetry1
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          11264;
        startFace       22352;
    }
    symmetry2
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          11264;
        startFace       33616;
    }
    wing
    {
        type            wall;
        inGroups        1(wall);
        nFaces          176;
        startFace       44880;
    }
    inout
    {
        type            patch;
        nFaces          176;
        startFace       45056;
    }
)

// ************************************************************************* //
