RAE2822_Airfoil_HISA/0_orig/include/freestreamConditions
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|    HiSA: High Speed Aerodynamic solver                                      |
|    Copyright (C) 2014-2017 Johan Heyns - CSIR, South Africa                 |
|    Copyright (C) 2014-2017 Oliver Oxtoby - CSIR, South Africa               |
|                                                                             |
\*---------------------------------------------------------------------------*/

U             (233.603 0 0);
p             108988.0;
T             255.56;
#inputMode    merge

// ************************************************************************* //
